***** example
      There are 3 blocks in the org file, but one is filterd out, so the result is 2 blocks.
      A proble can be seen: the block name is always empty.
      (press C-c C-c to run the src block)
      #+begin_src emacs-lisp 
      ;; (setq org-mode-file-name (aspk-org-tangle-next-test-data-block))
      (setq org-mode-file-name "test/data/1.org")
      ;; (format "%S" (pns-get-all-src-blocks org-mode-file-name nil "data"))
      (format "%S" (pns-get-all-src-blocks org-mode-file-name))
      #+end_src

      #+RESULTS:
      : (((beginning . 29) (end . 73) (name . "  ") (lang . "emacs-lisp") (tag . "") (content . "elisp") (level . 1) (heading . "headline 1")) ((beginning . 154) (end . 211) (name . "  ") (lang . "python") (tag . ":results output") (content . "python") (level . 1) (heading . "headline 2")))

      This is the input of test case:
      #+name: input
      #+begin_src org
      ,#+begin_src emacs-lisp
      elisp
      ,#+end_src

      ,#+begin_src emacs-lisp :not-a-snippet
      elisp2
      ,#+end_src

      ,* headline 2
      ,#+begin_src python :results output
      python
      ,#+end_src
      #+end_src


      This is the expected result of the test case:
      #+name: result
      #+begin_src emacs-lisp
      '(((beginning . 14) (end . 52) (name . "") (lang . "emacs-lisp") (tag . "") (content . "elisp") (level . 1) (heading . "headline 1"))
        ((beginning . 123) (end . 174) (name . "") (lang . "python") (tag . ":results output") (content . "python") (level . 1) (heading . "headline 2")))
      #+end_src

*** hatch codes: given templates list, prompt for input and expand a snippet
    a template, get form the new snippet file
    #+NAME: vars 
    #+begin_src elisp
    (setq pns-templates
          '(
            ((header . (("command" . "open") ("type" . "file") ("for" . (("read" . "<") ("write" . ">") ("append" . ">>") ("readwrite" . "+>")))))
             (content . "open my $fh, '`for`', ${1:file} or dir 'Open file failed';"))

            ((header . (("command" . "open") ("type" . "pipe") ("for" . (("read" . "|-") ("write" . "-|")))))
             (content . "open my $fh, '`for`', ${1:command} or dir 'Open command failed';"))
            ))
    #+end_src
    
    
    process step:
    1. for each parameter, merge to one list for selection
    2. based on the selected result, rebuild the list, the list that not match the result should be removed.
    3. repeat step 1, process next parameter.
       
       传入一个header列表，返回所有与这个列表匹配的contents
       select-content
       #+NAME: methods
    #+begin_src elisp
    (defun pns-contains (list1 list2)
      "Both list1 and list2 are assoc list. Return true if list1 contains all elements in list2. Definition:contains: elements in list2 exists in list1. The equal functon is string-equal or ... for subelement.
    e.g. list1 is header of a template, list2 is the selected data.
    "
      ;; TODO: should I consider order? 
      (let ((rst t)
            (e1))
        (mapc (lambda (e2)
                (setq e1 (assoc (car e2) list1))
                (unless (and e1 (cond ((stringp (cdr e1))
                                       (or (string-equal (cdr e1) "nil")
                                           (string-equal (cdr e2) (cdr e1))))
                                      ;; what's the logic here? =>(cdr e1) is a assoc list, while (cdr e2) always a string or something else. If (cdr e2) exists in (cdr e1)'s key set, then it means e1 contains e2.
                                      ;; BUG here. (cdr e1) also may be a list of string.
                                      ((and (listp (cdr e1)) (listp (car (cdr e1)))) (assoc (cdr e2) (cdr e1)))
                                      ((and (listp (cdr e1)) (stringp (car (cdr e1))))
                                       (member (cdr e2) (cdr e1)))
                                      (t (error "parameter format wrong: %S" e1))))
                  (setq rst nil)))
              list2)
        rst))



    (defun pns-filter-templates (header)
      "Get all templates whose header contains parameter"
      (delete nil
              (mapcar (lambda (tmpl)
                        (when (pns-contains (cdr (assoc 'header tmpl)) header)
                          tmpl))
                      pns-templates) ))

    (defun pns-get-contents (header)
      "Get all matched template's content. Match means its header contains the parameter header"
      (mapcar (lambda (tmpl) (cdr (assoc 'content tmpl)))
              (pns-filter-templates header)))


    #+end_src
    
    #+RESULTS: select-content
    | open my $fh, '`for`', ${1:file} or dir 'Open file failed'; |
    
    #+NAME: test-get-contents
    #+begin_src elisp
        (pns-get-contents '())

        (pns-get-contents '(("command" . "open")  ("for" . "read")))

        (pns-get-contents '(("type" . "file") ))

        (pns-get-contents '(("command" . "open") ("type" . "file") ("for" . "read")))

    #+end_src
    
    get header element value list
    #+NAME: methods
    #+begin_src elisp
    (defun pns-get-header-element-values (header-element-name &optional header-filter)
      "Get all values of a header element given its name, as a list. A name e.g. type, for, command. `header-filter' is a filter to filter the pns-templates before get."
      (unless header-filter (setq header-filter '()))
      (delete-dups
       (let ((rst nil))
         (mapc (lambda (tmpl)
                 (let* ((header (cdr (assoc 'header tmpl)))
                        (elem (assoc header-element-name header))
                        (value (and elem (cdr elem))))
                   (and value (cond ((stringp value) (setq rst (append rst (list value))))
                                    ((listp value)
                                     (setq rst (append
                                                rst (mapcar (lambda (ee)
                                                              (if (listp ee) (car ee) ee))
                                                            value))))))))
               (pns-filter-templates header-filter))
         rst)))

    #+end_src
    
    #+NAME: test-
    #+begin_src elisp
    (pns-get-header-element-values "for" '(("type" . "file")))
    #+end_src
    
    
    #+NAME: vars
    #+begin_src elisp
    ;; a list of header element names that we will get value
    (setq pns-header-names '("command" "type" "for"))
    #+end_src
    
    The basic functions ready, now built the app.
    #+NAME: methods
    #+begin_src elisp
    (defun  pns-prompt-for-header (&optional filter-header) 
      "Prompt for each parameter. Assumption: in the filtered templates, only one parameter key exists at pos idx. Not checked if there are two, but will use the first one silently. Snippet file should ensule this."
      (let ((templates t) (runp t)
            first-header key values tmp input
            (idx 0) rst)
        (while runp
          (tracel filter-header)
          (setq templates (pns-filter-templates filter-header))
          (unless templates (error "template nil. filter-header: %S" filter-header))
          (when  templates
            (setq first-header (pns-assoc 'header (car templates)))
            (setq key (car (nth idx first-header)))
            (unless key (setq runp nil))
            (when key
              (incf idx)
              (tracel first-header key idx)
              (if (assoc key filter-header)
                  (push (cons key (pns-assoc key filter-header)) rst)
                (setq values (pns-get-header-element-values key filter-header))
                (if (= (length values) 1)
                    (progn
                      (setq tmp (car values))
                      (setq input (car values))
                      (when (string-equal (car values) "nil")
                        ;; prompt for this key by read-string if (car vallues) is "nil"
                        ;; read-string will change point
                        (save-excursion
                          (setq input (read-string (format "%s: " key))))))
                  ;;>1. prompt for this key by helm
                  (setq input (helm-other-buffer `((name . ,key) (candidates . ,values)
                                                   (action . (lambda (c) c)))
                                                 "Select"))
                  (setq tmp input))
                (push (cons key tmp) filter-header)
                ;; this is the result
                (push (cons key input) rst))
              )
            ))
        (reverse rst)))

    (defun pns-prompt-for-header-old (header-names)
      "Based on the templates, prompt for each parameters"
      (let ((headers))
        (mapcar (lambda (key)
                  (let ((values (pns-get-header-element-values key headers))
                        tmp)
                    (tracel values)
                    (if (= (length values) 1)
                        (if (and (stringp (car values)) (string-equal (car values) "nil"))
                            (setq tmp (read-string (format "%s: " key)))
                          (setq tmp (car values)))
                      (setq tmp (helm-other-buffer `((name . ,key) (candidates . ,values)
                                                     (action . (lambda (c) c)))
                                                   "Select")))
                    (tracel key tmp)
                    (push (cons key tmp) headers)
                    (cons key tmp)))
                header-names)))

    (defun pns-create-expand-env (header tmpl)
      "Convert header to a expand-env that can be passed to yas-expand-snippet. header is a list, element is (key . value), both key and value are strings. The main job is handle this kind of parameter: (key (k1 v1) (k2 v2)), and changet the key to a symbol from string, change to a list from a cons"
      (let (tmp tmp1)
        ;; elem is a parameter
        (mapcar (lambda (elem)
                  ;; tmp is all possible values for the element key. TODO: where is definiton of tmpl?
                  (setq tmp (cdr (assoc (car elem) (cdr (assoc 'header tmpl)))))
                  ;; tmp1 is the target value
                  (setq tmp1 (cdr elem))
                  (cond ((listp tmp)
                         (mapc (lambda (vv)
                                 (if (consp vv)
                                     (when (string-equal (cdr elem) (car vv))
                                       (setq tmp1 (cdr vv)))))
                               tmp)))

                  (tracel elem tmp tmp1)
                  ;; elem: ("command" . "open"), tmp: "open", tmp1: "open"
                  ;; elem: ("type" . "file"), tmp: "file", tmp1: "file"
                  ;; elem: ("for" . "read"), tmp: (("read" . "<") ("write" . ">") ("append" . ">>") ("readwrite" . "+>")), tmp1: "+>"
                  (list (intern (car elem)) tmp1))
                header)))

    (defun pns-do-expand (&optional filter-header)
      "given header element list, expand a snippet."
      (let* ((header (pns-prompt-for-header filter-header))
             (templates (pns-filter-templates header)))
        (tracel header)
        (mapc (lambda (tmpl)
                (yas-expand-snippet (cdr (assoc 'content tmpl)) (point) (point)
                                    (pns-create-expand-env header tmpl)))
              templates)))

    (defun pns-main ()
      (interactive)
      (pns-do-expand))

    (defun pns-main-shortcut ()
      (interactive)
      (pns-do-expand '(("command" . "create-channel") ("for" . "read") ("file-name" . "\"aaa.b\""))))

    #+end_src
    
    #+RESULTS: methods
=pns-get-all-src-blocks-coolie
==pns-src-block-filter
==pns-tool-convert-all
=    ==============    ==    ==    ===================pns-do-xxx
    =    
    
    #+NAME: test-
    #+begin_src elisp
    (pns-prompt-for-header)
    (pns-get-contents (pns-prompt-for-header))
    (pns-do-expand pns-header-names)
    #+end_src
    
*** hatch codes:  support shortcut
    #+NAME: vars
    #+begin_src elisp
(defvar pns-shortcuts nil "this is a temp variable to save current list of shortcut")
(setq pns-shortcut-entry-regexp  "^\*+\s+shortcut.*")
    #+end_src
    
    #+RESULTS: vars
    =@
    ==@
    ==@
    =    
**** the new parser
     #+NAME: vars-hatch
     #+begin_src elisp
     (setq pns-token-reference "\\$")
     (setq pns-token-default-value "=")
     (setq pns-token-doc "@")
     #+end_src
     
     #+NAME: methods-hatch
     #+begin_src elisp :results output
     (defun pns-parse-parameter (parameter)
       "parse a parameter to the pns-parameter struct. The parameter is read form the snippet file, are a list of symbols"
       ;; a input parameter is in this format:
       ;; 1. (key value)
       ;; 2. (key (display-value real-value) )
       ;; an element may be a symbol, or a string, and there are special elemnt, which start with a special character.
       (let (para elem pp)

         ;; convert all to string
         (setq para
               (mapcar (lambda (element)
                         (cond ((stringp element) (format "\"%s\"" element))
                               ((symbolp element) (format "%s" element))
                               ((listp element)
                                (mapcar (lambda (elem)
                                          (cond ((stringp elem) (format "\"%s\"" elem))
                                                ((symbolp elem) (format "%s" elem))
                                                (t (error "Elem type wrong: %S" elem))))
                                        element)
                                )
                               (t (error "Parameter's element type wrong, only symbol or string accepted: %S" element))))
                       parameter))

         ;; make pns-parameter
         (setq pp (make-pns-parameter))
         (setf (pns-parameter-key pp) (pop para))
         (tracee pp)
         (unless (pns-parameter-key pp)
           (error "Parameter is nil: %S" para))

         (while para
           (setq elem (pop para))
           (tracee elem)
           (cond
            ;; parse values
            ((listp elem)
             (setf (pns-parameter-values pp) (append (list (cons (nth 0 elem) (nth 1 elem))) (pns-parameter-values pp))))

            ;; BUG: if $ not at the begining, still matched.
            ;; parse doc
            ((and (stringp elem) (string-match pns-token-doc elem))
             (setf (pns-parameter-doc pp) (substring elem 1)))

            ;; parse reference
            ((and (stringp elem) (string-match pns-token-reference elem))
             (setf (pns-parameter-reference pp) (substring elem 1)))

            ;; parse default-value
            ((and (stringp elem) (string-match pns-token-default-value elem))
             (setf (pns-parameter-default-value pp) (substring elem 1)))

            (t (message "here")
               (unless (stringp elem) (error "Element is not string: %S" elem))
               (setf (pns-parameter-values pp) (append (list (cons elem elem)) (pns-parameter-values pp))))
            )
           )
         (tracee pp)
         pp))

     (defun pns-parse-header (header)
       (mapcar (lambda (parameter)
                 (pns-parse-parameter parameter))
               header))

     (defun pns-parse-templates (templates)
       (mapcar (lambda (tmpl)
                 (pns-parse-header (pns-assoc 'header tmpl)))
               templates))

     (defun pns-do-xxx ()
       (pns-parse-templates pns-tmp-templates))

     (defun pns-format-parameter (parameter)
       (format " key: %s\n values: %s\n doc: %s\n default-value: %s\n reference: %s\n not-prompt-p: %s\n\n"
               (pns-parameter-key parameter)
               (pns-parameter-values parameter)
               (pns-parameter-doc parameter)
               (pns-parameter-default-value parameter)
               (pns-parameter-reference parameter)
               (pns-parameter-not-prompt-p parameter))
       )

     (message "%S" (mapcar (lambda (header)
                             (mapcar (lambda (parameter)
                                       (pns-format-parameter parameter))
                                     header))
                           (pns-do-xxx)))
     #+end_src
     
     
     this function convert the snippet file's src blocks tree to a the lisp repreent part. The main job is merge 'header' and 'content' src blocks.
     
     #+name: test-input 
     #+BEGIN_SRC org :disabled-tangle /tmp/pns.x.y/1.org :mkdirp yes
     ,* snippet: aaa
       ,#+name: header
       ,#+begin_src elisp
        ((g-file-name "=abc.txt") (g-file-handler =$fh))
       ,#+end_src

       aaaa

     ,** aaaaa
        ,#+name: header
        ,#+begin_src elisp
        ((command open "@open a file") (target file "@not a pipe")
         (for =write (read <) (write >) (append >>) (readwrite +>))
         (file-name $g-file-name) (file-handler $g-file-handler))
        ,#+end_src
        aaa 
        
        ,#+name: content
        ,#+begin_src perl :results output
        open my `file-handler`, `for`, `file-name` or die "Open file failed";
        ,#+end_src
        aaa
     ,** bbbbb
        ,#+name: header
        ,#+begin_src elisp
        ((command close "@close a file") (file-handler $g-file-handler))
        ,#+end_src
        aaaa 
        ,#+name: content
        ,#+begin_src perl :results output
        close `file-handler`;
        ,#+end_src

        aaaa

     #+END_SRC
        
        #+name: test-input
        #+NAME: test-methods for pns-create-templates
        #+begin_src elisp
        (setq snippet-file "/tmp/pns.x.y/1.org")

        (setq pns-tmp-header nil)
        (setq pns-tmp-templates nil)
        (pns-create-templates
         (pns-convert-block-list-to-tree (pns-get-all-src-blocks snippet-file pns-snippet-entry-regexp pns-src-block-name-regexp))
         nil nil)
        ;; the result is in pns-tmp-templates
        (message "%S" pns-tmp-templates)
        #+end_src
        
        #+RESULTS: test-methods
     : (((header (g-file-name "=abc.txt") (g-file-handler =$fh) (command open "@open a file") (target file "@not a pipe") (for =write (read <) (write >) (append >>) (readwrite +>)) (file-name $g-file-name) (file-handler $g-file-handler)) (content . "   open my `file-handler`, `for`, `file-name` or die \"Open file failed\";
     : ")) ((header (g-file-name "=abc.txt") (g-file-handler =$fh) (command close "@close a file") (file-handler $g-file-handler)) (content . "   close `file-handler`;
     : ")))
        
        
        
        
    
